def muutuja (moghan):
    return moghan / 0.381
ratkasu= muutuja
print(ratkasu(17.5))



luvut=[12 , 0 ,11 ,21 ,2 ]

def Tupla ():
    print(tuple(x * 2 for x in luvut ))
Tupla()

x = 18

if x > 10:  # 18 > 10 صح (True)
    print("A")  # طبع A ونزل للداخل

    if x > 15:  # 18 > 15 صح (True)
        print("B")  # طبع B

    if x > 20:  # 18 > 20 غلط (False) -> انتقل للـ else الخاصة بـ (x > 20)
        print("C")
    else:  # هذه الـ else تابعة لـ (if x > 20) فقط!
        print("D")  # طبع D لأن 18 ليست أكبر من 20



    x = 25

if x > 10:  # 25 > 10 صح (True)
    print("A")  # طبع A وقرر الخروج من كل السلسلة مباشرة!
elif x > 20:  # يتم تجاهله تماماً
    print("B")
else:  # يتم تجاهله تماماً لأن الشريحة الفوقانية تحققت
    print("C")



# كود واحد يجمع كل النكشات الحسابية في الامتحان
a = 2**3**2  # 1. أس متكرر: يحسب من اليمين (2 ** 9)
b = -7 // 3  # 2. قسمة سالبة: يقرب للأصغر دائماً
c = -7 % 3  # 3. باقي قسمة سالب: يأخذ إشارة المقام (الموجبة)
d = 3 // 8  # 4. صغير // كبير: الناتج 0 دائماً
e = 3 % 8  # 5. صغير % كبير: الناتج هو الرقم الصغير نفسه

print(a, b, c, d, e)